# Brewfile for MacBook Pro Setup
# Generated based on current application inventory

# Taps
# tap "homebrew/bundle"  # Deprecated - no longer needed
tap "homebrew/services"
# tap "homebrew/cask-fonts"  # Deprecated - fonts moved to homebrew/core
tap "microsoft/git"

# CLI Tools
brew "git"
brew "curl"
brew "wget"
brew "tree"
brew "htop"
brew "jq"
brew "yq"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"            # exa was renamed to eza
brew "fzf"
brew "tmux"
brew "neovim"
brew "starship"       # shell prompt
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "mas"            # Mac App Store CLI
brew "mackup"         # sync app preferences
brew "ffmpeg"
brew "imagemagick"
brew "gh"             # GitHub CLI
# brew "glab"           # GitLab CLI

# Development Tools
brew "python@3.12"
brew "pyenv"
brew "pipenv"
brew "poetry"
brew "node"
brew "nvm"
brew "yarn"
# brew "go"
# brew "rust"
brew "docker"
brew "docker-compose"
# brew "postgresql"
# brew "redis"
# brew "sqlite"

# GUI Applications via Homebrew Cask

# Browsers
cask "arc"
cask "google-chrome"
# cask "zen-browser"    # Currently having download issues - install manually if needed

# Development
cask "cursor"
cask "sublime-text"
cask "dbeaver-community"  # dbeaver is now dbeaver-community
cask "postman"
# cask "docker"         # Commented out due to permission issues - install manually if needed

# Terminals
cask "iterm2"
# Note: Ghostty might need manual installation

# Productivity
cask "raycast"
cask "notion"
cask "obsidian"
# cask "joplin"         # Version conflict - install manually if needed
cask "1password"
cask "bartender"       # bartender5 doesn't exist, use bartender
# cask "magnet"         # Not available via cask - use Mac App Store version instead
# cask "amphetamine"    # Not available via cask - use Mac App Store version instead
cask "alt-tab"         # alttab is now alt-tab
cask "maccy"           # clipboard manager
cask "cleanshot"
cask "shottr"

# Communication
cask "slack"
cask "zoom"
cask "whatsapp"
# Note: Superhuman, Spark might need manual installation

# Media & Entertainment
cask "spotify"
# cask "vlc"
cask "kindle"

# Security & VPN
# cask "nordvpn"
# Note: AWS VPN Client, OpenVPN Connect, SentinelOne might need manual installation

# Cloud Storage
cask "google-drive"

# Design & Documents
cask "grammarly-desktop"
# Note: Microsoft Office might be better via Mac App Store

# Utilities
cask "the-unarchiver"

# Fonts (now available in homebrew/core)
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-source-code-pro"
cask "font-hack"
cask "font-sauce-code-pro-nerd-font"  # Updated name
# cask "font-source-code-pro"          # Duplicate removed
cask "font-source-sans-pro"
cask "font-source-serif-pro"

# Mac App Store Applications (via mas)
# Get app IDs with: mas search "App Name"
mas "Magnet", id: 441258766
mas "Amphetamine", id: 937984704
mas "Microsoft Excel", id: 462058435
# mas "Microsoft Word", id: 462054704
# mas "Microsoft PowerPoint", id: 462062816
# mas "Microsoft OneNote", id: 784801555
# mas "Pages", id: 409201541
# mas "Numbers", id: 409203825
# mas "Keynote", id: 409183694
# mas "GarageBand", id: 682658836
# mas "iMovie", id: 408981434
mas "Xcode", id: 497799835  # Uncomment if you need Xcode
